jhkim0712/ESP32-S3-Touch-LCD-7/sdkconfig.defaults
# ============================================================
#  ESP32-S3-Touch-LCD-7 defaults (ESP-IDF v5.3+)
#  NOTE: keep this file ASCII-only. kconfgen reads it with the
#  system locale encoding (cp949 on Korean Windows).
# ============================================================
CONFIG_IDF_TARGET="esp32s3"

# ---------- Flash / Partition ----------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---------- CPU / Cache ----------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# Event handlers load/save NVS settings (default 2304 is too tight)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# Panic immediately (naming the task) when any task reaches the end of its
# stack. The default canary check only runs at context switches and can miss
# an overflow, which then corrupts a neighbouring TCB and crashes elsewhere.
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# ---------- PSRAM (Octal 8MB) ----------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Execute code/rodata from PSRAM so flash writes (OTA, NVS, LittleFS)
# do not disable the cache -> prevents RGB LCD drift.
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# ---------- RGB LCD ----------
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# ---------- Wi-Fi / Network ----------
# Internal RAM is the scarce resource (RGB bounce buffers, TLS, BLE).
# Throughput is not important here, so keep Wi-Fi code out of IRAM.
# (TX buffers stay static: with SPIRAM_TRY_ALLOCATE_WIFI_LWIP they are
#  already allocated in PSRAM, and dynamic TX is not selectable then.)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000

# ---------- TLS (GitHub / Yahoo / Open-Meteo HTTPS) ----------
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Chains that end in a cross-signed root no longer in the bundle (e.g. rss.app:
# GTS Root R4 cross-signed by the retired "GlobalSign Root CA") verify against
# the in-bundle root instead of failing the handshake.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# ---------- Web settings (HTTP server + mDNS smart-display.local) ----------
# mDNS only answers queries and does no flash writes, so its task stack and
# packet buffers can live in PSRAM. Browse/console/AP/ETH are not used.
# Photo manager URLs carry a sub-folder path + file name (URL-encoded Korean
# names are 3x longer than the bytes).
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y
CONFIG_MDNS_ENABLE_CONSOLE_CLI=n
CONFIG_MDNS_ENABLE_BROWSE=n
CONFIG_MDNS_PREDEF_NETIF_AP=n
CONFIG_MDNS_PREDEF_NETIF_ETH=n

# ---------- OTA ----------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ---------- Bluetooth (BLE music remote) ----------
# Disabled to save internal RAM. To enable the BLE music remote, replace the
# line below with the commented block and set CONFIG_APP_BLE_MEDIA=y.
CONFIG_BT_ENABLED=n
# CONFIG_BT_ENABLED=y
# CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL=y        # GATT client (iOS AMS) depends on it
# CONFIG_BT_NIMBLE_GATT_CLIENT=y
# CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
# CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# CONFIG_BT_NIMBLE_NVS_PERSIST=y
# CONFIG_BT_NIMBLE_SM_SC=y
# CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
# CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
# CONFIG_APP_BLE_MEDIA=y

# ---------- Storage ----------
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
# Web upload/delete and the slideshow touch the SD card from different tasks.
# FatFs file locking makes deleting a file that is open for reading fail
# (EBUSY) instead of corrupting the volume. The limit counts open files AND
# directories: the photo scan keeps up to 5 directories open (depth 4), the
# web server 1-2, plus the files being read/written.
CONFIG_FATFS_FS_LOCK=10

# ---------- LVGL 9.x ----------
CONFIG_LV_COLOR_DEPTH_16=y
# LVGL heap goes to PSRAM via components/ui/lv_mem_psram.c (clib malloc would put
# every allocation < 4KB, e.g. glyph cache entries, into internal RAM)
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=16
# LV_ATTRIBUTE_FAST_MEM_USE_IRAM is left off: with GCC 15 (IDF 6.x) LVGL 9.2
# fails with conflicting .iram1.N section attributes, and code runs from PSRAM (XIP).
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_TINY_TTF=y
# Korean UI font and weather icons are TTF files in LittleFS (/storage/fonts)
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=256
CONFIG_LV_USE_SYSMON=n
